<template>
  <div class="deal-box">
    <van-checkbox
      v-model="checkbox"
      icon-size="20px"
      class="checkbox"
      checked-color="#599524"
    ></van-checkbox>
    我已阅读并同意<span @click="show = true">用户协议</span>与<span
      @click="show = true"
      >隐私政策</span
    >
  </div>
  <van-overlay :show="show" @click="show = false" z-index="20">
    <div class="wrapper" @click.stop>
      <h3>智慧农资用户协议</h3>
      <p class="text">
        欢迎使用“益农宝”提供的服务！益农宝（“我们”）深知个人信息对您的重要性，我们一向庄严承诺保护使用我们的产品和服务益农宝之用户（以下统称“用户”或“您”）的个人信息及隐私安全。您在使用益农宝时，我们可能会收集和使用您的相关个人信息。我们希望通过《隐私政策》（以下简称“《隐私政策》”或“本政策”）向您说明我们在收集和使用您相关个人信息时对应的处理规则等相关事宜，以便更好地保障您的权益。
        本政策将帮助您了解以下内容： 一、我们如何收集和使用您的个人信息
        二、我们如何使用 Cookie 和同类技术
        三、我们如何共享、转让、公开披露您的个人信息
        四、我们如何保护您的个人信息 五、您如何管理个人信息安全
        六、未成年人信息的保护 七、通知和修订 八、如何联系我们
        本隐私政策与您所使用的益农宝服务以及该服务所包括的各种业务功能（以下统称“我们的服务与/或产品”）息息相关，希望您在使用我们的服务与/或产品前仔细阅读并确认您已经充分理解本政策所写明的内容，并让您可以按照本隐私政策的指引做出您认为适当的选择。本隐私政策中涉及的相关术语，我们尽量以简明扼要的表述，以便您更好地理解。请注意我们会不时地检查我们的政策，因此有关的措施会随之变化。我们恳请您定期关注本页面，以确保对我们《隐私政策》最新版保持了解。
        您使用或在我们更新本隐私政策后继续使用我们的服务与/或产品，即意味着您同意本隐私政策(含更新版本)内容，并且同意我们按照本隐私政策收集、使用、保存和共享您的相关信息。
        本隐私政策适用中农在线网站，包括电脑端以及WAP端、小程序及其他客户端；益农宝（“APP”）。
        一、我们如何收集和使用您的个人信息
        在您使用益农宝服务的过程中，我们会收集您在使用服务时主动提供或因为使用服务而产生的信息，用以向您提供服务、提升我们的服务质量、以及保障您的帐号安全：
        1、当您注册益农宝服务时，我们会收集您的手机号码、短信验证码、密码信息，收集这些信息是为了帮助您完成注册，保护您的益农宝帐号的安全。手机号码属于敏感信息，益农宝是基于手机号码提供的服务，如果您不提供此类信息，您无法正常使用我们的服务；您设置的账户用户名为您的手机号码，您可以修改补充您的真实姓名、性别、生日、所在地等相关信息，这些信息均属于您的“账户信息”。您补充的账户信息将有助于我们为您提供个性化的庄稼医院推荐和/或更优的作物就诊体验及益农宝相关服务，但如果您不提供这些补充信息，不会影响您使用益农宝相关服务的基本功能；
        2、当您使用账号密码或短信验证码方式登录时，我们需要收集您的手机账号、密码、验证码信息，如您不提供此类信息，您将无法通过这类方式登录您的益农宝账号，可能无法继续使用我们的服务；当您使用一键快速登录、扫码登录、快捷登录功能，我们需要采集您的手机号码信息，如不提供将影响您通过这类方式登录益农宝；
        3、当您使用益农宝时，为保障您正常使用我们的服务，维护我们服务的正常运行，改进及优化我们的服务体验以及保障您的帐号安全，我们会收集您的行为日志（账户信息、用户会话、访问时间、访问页面、客户端IP地址信息）、及终端信息（设备型号、操作系统、设备标识、浏览器信息），这类信息是为提供服务必须收集的基础信息；
        4、当您上传图片、使用相机、编辑头像、使用扫一扫功能时，我们需要获取摄像头和读取相册权限，拒绝提供仅会影响您使用这类功能，但不会影响其他功能使用；
        5、当您使用益农宝App时，我们会收集您的位置信息（我们仅收集您当时所处的地理位置，但不会将您各时段的位置信息进行结合以判断您的行踪轨迹）来判断您所处的地点，自动为您推荐您所在区域推荐的庄稼医院、附近的作物问答及当地的天气气象。比如向您推荐您所在地区的庄稼医院。
        6、正常下载的图片，需要您提供存储权限，拒绝提供仅会影响您使用这类功能，但不会影响其他功能使用；
        7、如您在授权使用第三方账号登录时，我们会从第三方获取您共享的账号信息（如头像、昵称等），并在您同意本隐私政策后将您的第三方账户与益农宝账户进行绑定；
        8、益农宝对第三方应用工具包的使用 包括： 1）友盟统计
        SDK用途：提供统计分析服务，并通过地理位置校准报表数据准确性，提供基础反作弊能力，帮助本平台产品功能实现。以及当本平台系统发生故障时，记录和分析系统故障时产生的信息，优化服务。
        SDK收集的个人信息类型：友盟+SDK需要收集您的设备Mac地址、唯一设备识别码（IMEI/android
        ID/IDFA/OPENUDID/GUID、SIM 卡 IMSI 信息）。 2）微信
        SDK用途：第三方账号登录，以及分享益农宝内容到第三方平台。
        SDK收集的个人信息类型：设备信息 3）QQ
        SDK用途：第三方账号登录，以及分享益农宝内容到第三方平台
        SDK收集的个人信息类型：设备信息 4）丰收互联 SDK用途：调起丰收互联APP
        SDK收集的个人信息类型：设备信息 5）百度推送 SDK用途：推送通知给用户，
        SDK收集的个人信息类型：设备信息 日志信息 位置信息 应用程序列表信息
        9、根据相关法律法规及国家标准，在以下情形中，我们可能会依法收集并使用您的个人信息，无需征得您的同意:
        （1）与国家安全、国防安全直接相关的；
        （2）与公共安全、公共卫生、重大公共利益直接相关的；
        （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
        （4）出于维护您或他人的生命、财产等重大合法权益但又很难得到您本人同意的；
        （5）所收集的个人信息是您自行向社会公众公开的；
        （6）从合法公开披露的信息中收集个人信息，例如：合法的新闻报道、政府信息公开等渠道；
        （7）根据您的要求签订和履行合同所必需的；
        （8）用于维护所提供的服务的安全稳定运行所必需的，例如：发现、处置服务的故障；
        （9）法律法规规定的其他情形。
        请注意，无法与任何特定个人直接建立联系的数据，不属于个人信息。如果我们将无法与任何特定个人建立联系的数据与其他信息结合用于识别自然人个人身份，或者将其与个人信息结合使用，则在结合使用期间，此类信息将被视为个人信息。
        二、我们如何使用 Cookie 和同类技术 （一）Cookies的使用
        1、为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies
        是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。我们向您发送Cookies是为了简化您重复登录的步骤，帮助判断您的登录状态以及账户或数据安全。
        2、我们不会将 Cookies
        用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
        Cookies。您可以清除计算机上保存的所有
        Cookies，大部分网络浏览器会自动接受Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝
        Cookies；另外，您也可以清除浏览器内保存的所有Cookies，移动端退出登录后也可以清除所有Cookies。但如果您这么做，您可能需要在每一次访问益农宝网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。
        （二）网络Beacon和同类技术的使用 除 Cookie
        外，我们还会在网站上使用网络Beacon等其他同类技术。我们的网页上常会包含一些电子图像（称为"单像素"
        GIF 文件或 "网络 beacon"）。我们使用网络beacon的方式有：
        1、通过在益农宝网站上使用网络beacon，计算用户访问数量，并通过访问 cookie
        辨认注册的益农宝用户。 2、通过得到的cookies信息，为您提供个性化服务。
        三、我们如何共享、转让、公开披露您的个人信息 （一）共享
        1、我们不会与我们以外的任何第三方公司、组织和个人共享您的个人信息，但以下情况除外：
        （1）事先获得您明确的同意或授权；
        （2）根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下进行提供；
        （3）在法律法规允许的范围内，为维护中农在线网站/益农宝App、及关联方或合作伙伴、您或其他用户或社会公众利益、财产或安全免遭损害而有必要提供；
        （4）
        只有共享您的个人信息，才能实现我们的产品或服务的核心功能或提供您需要的服务；
        （5）应您需求为您处理您与他人的纠纷或争议；
        （6）符合与您签署的相关协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；
        （7）基于学术研究而使用； （8）基于符合法律法规的社会公共利益而使用。
        2、我们可能会将您的个人信息与我们的关联方共享。但我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。我们的关联方如要改变个人信息的处理目的，将再次征求您的授权同意。
        3、我们可能会向合作伙伴等第三方共享您的账户信息、设备信息以及位置信息，以保障为您提供的服务顺利完成。但我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。
        当前我们的合作伙伴类型：
        技术服务的供应商。我们可能会将您的个人信息共享给支持我们功能的第三方。这些支持包括为我们的供货或提供基础设施技术服务、支付服务、数据处理等。我们共享这些信息的目的是可以实现我们产品与/或服务的核心功能，比如我们必须与短信服务提供商提供您的手机号才能发送短信验证消息；或者我们需要将您的位置与第三方气象机构共享以实现其确认您当前的位置信息等。
        4、对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。不过,这并不包括违反本隐私政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的个人信息。
        （二）转让
        在涉及合并、收购、资产转让或类似的交易时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私政策的约束，否则,我们将要求该公司、组织重新向您征求授权同意。
        （三）公开披露
        我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才可能公开披露您的个人信息：
        1、根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；
        2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。
        （四）共享、转让、公开披露个人信息时事先征得授权同意的例外
        以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
        1、与国家安全、国防安全有关的；
        2、与公共安全、公共卫生、重大公共利益有关的；
        3、与犯罪侦查、起诉、审判和判决执行等有关的；
        4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
        5、其他维护公共利益的情形，例如您的信用评价信息需要被公开/共享；
        6、您自行向社会公众公开的个人信息；
        7、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
        根据法律规定，共享、转让、公开披露经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，我们对此类数据的处理将无需另行向您通知并征得您的同意。
        四、我们如何保护您的个人信息
        我们仅在本政策所述目的所必需期间和法律法规要求的最短时限内储存您的个人信息。如我们终止服务或运营，我们将及时停止继续收集您个人信息的活动，同时会遵守相关法律法规要求提前向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理，但法律法规或监管部门另有规定的除外。
        我们在中华人民共和国境内运营中收集和产生的个人信息，储存在中国境内，以下情形除外：
        1、法律法规有明确规定； 2、获得您的授权同意。
        针对以上情形，我们会确保依据本政策及国家法律法规要求对您的个人信息提供足够的保护。
        五、您如何管理个人信息安全
        按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
        （一）访问您的个人信息
        您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：
        账户信息——您可以访问、更正您账户中的个人资料及账号信息（手机号除外）、账号绑定信息等，也可以更改您的密码、添加安全信息或关闭您的账户等，您可以通过访问网页及App在设置中执行此类操作。
        （二）更正您的个人信息
        当您发现我们处理的关于您的个人信息有错误时，您有权自主操作更正、或要求我们做出更正。您可以通过“（一）访问您的个人信息”中罗列的方式进行更正。如果您无法通过上述方式更正个人信息，可通过本政策列明的联系方式与我们联系，我们尽量实现您的更正请求。
        （三）删除您的个人信息
        在以下情形中，您可以向我们提出删除个人信息的请求：
        1、如果我们处理个人信息的行为违反法律法规；
        2、如果我们收集、使用您的个人信息，却未征得您的同意；
        3、如果我们处理个人信息的行为违反了与您的约定；
        4、如果您不再使用我们的产品或服务，或您注销了账号；
        5、如果我们不再为您提供产品或服务。
        若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
        当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
        （四）个人信息主体注销账户
        在符合益农宝的服务协议约定条件及国家相关法律法规规定的情况下，您的益农宝账户可以被关闭或注销，在关闭或注销账户之后，我们将暂停为您提供产品或服务；也可以依据您的要求，及时删除您的个人信息或做匿名化处理，法律法规另有规定或双方另有约定的除外。如果您需要关闭或注销您的益农宝账户，您可以通过访问益农宝App页面上的“设置”—“账号设置”——“注销账号”进行在线操作；或者请通过本政策列明的联系方式与我们联系，我们将在确认您本人身份和真实意愿后为您完成关闭或注销工作。
        （五）除外情况
        对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。在以下情形中，按照法律法规要求，我们将无法响应您的请求：
        1、与国家安全、国防安全直接相关的；
        2、与公共安全、公共卫生、重大公共利益直接相关的；
        3、与犯罪侦查、起诉、审判和判决执行等直接相关的；
        4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
        5、所收集的个人信息是个人信息主体自行向社会公众公开的；
        6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
        7、根据个人信息主体要求签订和履行合同所必需的；
        8、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
        9、个人信息控制者为新闻单位且其在开展合法的新闻报道所必需的；
        10、个人信息控制者为学术研究机构，出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
        11、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
        12、有充分证据表明您存在主观恶意或滥用权利的；
        13、涉及侵犯他人商业秘密或个人隐私的； 14、法律法规规定的其他情形。
        （六）对第三方责任的声明
        请您注意，我们的第三方合作伙伴（如：第三方服务供应商、承包商、代理、广告合作伙伴、应用开发者等）可能有自己的隐私权保护政策；当您查看第三方创建的网页或使用第三方开发的应用程序时，这些第三方可能会放置他们自己的Cookie或网络Beacon，这些Cookie或网络Beacon不受我们的控制，且它们的使用不受本政策的约束。我们会努力去要求这些主体对您的个人信息采取保护措施，但我们无法保证这些主体一定会按照我们的要求采取保护措施，请您与他们直接联系以获得关于他们的隐私权政策的详细情况。如您发现这些第三方创建的网页或第三方开发的应用程序存在风险时，建议您终止相关操作以保护您的合法权益。
        六、未成年人信息的保护
        1、我们期望父母或监护人指导未成年人使用我们的服务。我们将根据国家相关法律法规的规定保护未成年人的信息的保密性及安全性。
        2、如您为未成年人，建议请您的父母或监护人阅读本政策，并在征得您父母或监护人同意的前提下使用我们的服务或向我们提供您的信息。对于经父母或监护人同意而收集您的信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护您的权益所必要的情况下使用或公开披露此信息。如您的监护人不同意您按照本政策使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。
        3、如您为未成年人的父母或监护人，当您对您所监护的未成年人的信息处理存在疑问时，请通过本政策中的联系方式联系我们。
        七、通知和修订
        1、为给您提供更好的服务以及随着益农宝业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在益农宝移动端上发出更新版本或以其他适当方式提醒您相关内容的更新，我们恳请您定期关注本页面，以确保对我们《隐私政策》最新版保持了解。
        2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。
        本隐私政策所指的重大变更包括但不限于：
        （1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
        （2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
        （3）个人信息共享、转让或公开披露的主要对象发生变化；
        （4）您参与个人信息处理方面的权利及其行使方式发生重大变化；
        （5）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
        （6）个人信息安全影响评估报告表明存在高风险时。 八、如何联系我们
        如果您有任何疑问、意见和建议，或者有本产品相关数据安全投诉举报，请通过以下联系方式与我们联系：
        电子邮件：support@114nz.com 客服热线：4008596318
        我们会妥善并及时处理您反馈的问题，一般情况下，我们将会在验证您的身份后15天内做出答复。
      </p>
    </div>
  </van-overlay>
</template>

<script>
import { watch, ref } from "vue";
export default {
  props: {
    checked: {
      type: Boolean,
      default: false
    }
  },
  setup(props, { emit }) {
    const checkbox = ref(false);
    const show = ref(false);

    watch(checkbox, newVal => {
      emit("update:checked", newVal);
    });

    return { checkbox, show };
  }
};
</script>

<style lang="stylus">
.deal-box
  position relative
  padding-left 30px
  font-size 13px
  color #999999
  .checkbox
    position absolute
    left 0
    top 0
  & > span
    color #333333
.wrapper
  width 80%
  height 90%
  margin 10% auto
  overflow auto
  background #fff
  padding 12px
  h3
    text-align center
    font-size 18px
  .text
    font-size 14px
</style>
